Autodesk.Revit.UI.ExternalEventRequest
Represents the possible outcomes of a request for raising an external event.

Autodesk.Revit.UI.ExternalEventRequest.TimedOut
Request not accepted due to synchronization issues with other thread(s).

Autodesk.Revit.UI.ExternalEventRequest.Denied
Request was denied due to failures of the corresponding event handler.

Autodesk.Revit.UI.ExternalEventRequest.Pending
Request not accepted, because the previous request is still pending (not executed).

Autodesk.Revit.UI.ExternalEventRequest.Accepted
Request accepted; event was added into the event queue and will be executed momentarily.